'use strict'

const userCode = {
  30000: '登录失败',
  30001: '验证码错误',
  30002: '用户不存在',
  30003: '用户名或密码错误',
}

const photoAlbumCode = {
  30101: '相册名称已存在',
  30102: '无权查看别人的相册',
  30103: '无权修改别人的相册',
  30104: '无权修改别人的图片',
  30105: '无权获取别人的图片',
  30106: '无权删除别人的图片',
  30107: '无权删除别人的相册',
  30108: '上传图片已存在于其它相册',
  30109: '上传图片已存在于本相册',
  30110: '要恢复图片不存在',
  30111: '要彻底删除的图片不存在',
}

const pprCode = {
  30201: '句子分类已存在',
  30202: '句子已存在于该分类',
  30203: '句子不存在',
  30204: '你不能操作别人的资源', // 所有权限限制的用这个
  30205: '主题名称已存在',
  30206: '无权删除别人的主题',
  30207: '不能删除或修改默认主题',
  30208: '无权修改别人的主题',
}

const CodeMessage = {
  getMessage (code) {
    return this[code] || ''
  },
  0: '成功',
  1: '创建成功',
  2: '更新成功',
  3: '删除成功',
  9999: '服务器未知错误',
  10000: '未携带令牌',
  10010: '授权失败',
  10020: '资源不存在',
  10030: '参数错误',
  10040: '令牌失效',
  10050: '令牌过期',
  10060: '字段重复',
  10070: '禁止操作',
  10080: '请求方法不允许',
  10100: '刷新令牌获取失败',
  10110: '{name}大小不能超过{size}字节',
  10120: '文件数量过多',
  10130: '不支持类型为{ext}的文件',
  10140: '请求过于频繁，请稍后重试',
  10200: '失败',
  ...userCode,
  ...photoAlbumCode,
  ...pprCode,
}

export default CodeMessage
